app/controllers/profiles_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "profiles" ("user_id", "first_name", "last_name", "job_title", "phone_number", "contact_email", "description", "created_at", "updated_at", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "profiles" SET "user_id" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["user_id", nil], ["updated_at", 2017-08-21 16:57:30 UTC], ["id", 3]]
---
  def create
    # Ensure that we have the user who is filling out form
   @user = User.find( params[:user_id])
   # Create profile links to this specific user
   @profile = @user.build_profile( profile_params )
   if @profile.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @user = User.find( params[:user_id] )

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "profiles" SET "job_title" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["job_title", "Investor"], ["updated_at", 2017-08-22 21:59:34 UTC], ["id", 1]]
---
  def update
    @user = User.find( params[:user_id] )
    # Retrieve that user's profile
    @profile = @user.profile
    # Mass assign edited profile attributes and save (update)
    if @profile.update_attributes(profile_params)